abdominal
aberration
ability
abnormal
abnormality
abortion
absence
absorption
acceleration
accumulation
acetate
acetyl
acetylcholine
acetylcholinesterase
acid
acidosis
acids
acquire
acromegaly
across
acth
actinomycin
action
activate
activation
activator
active
activity
acute
acyl
adaptation
adenine
adenosine
adenovirus
adenylate
adipose
adjuvant
administer
administration
adolescent
adrenal
adrenaline
adrenergic
adrenoceptor
adsorption
adult
aerobic
aerosol
aeruginosa
affect
afferent
affinity
aflatoxin
african
agar
age
aged
agent
agglutination
aggregation
agonist
air
airborne
airway
alanine
albican
albumin
alcohol
aldosterone
alkaline
alkyl
allergic
allogeneic
allograft
alpha
alter
alteration
alveolar
american
amine
amines
amino
aminoacyl
aminotransferase
ammonium
amniotic
among
amp
amphetamine
amphibian
amylase
amyloid
amyloidosis
anaemia
anaerobic
analogue
analysis
anaphylaxis
anatomical
anemia
aneurysm
angina
angiographic
angiotensin
angle
anhydrase
animal
anion
anomalous
anoxia
antagonism
antagonist
anterior
anthracene
anti
antibacterial
antibiotic
antibodie
antibody
antigen
antigenic
antihypertensive
antisera
antiserum
aorta
aortic
aplysia
apparatus
apparent
appearance
application
apply
approach
aqueous
arabinose
area
arginine
aromatic
arrest
arterial
artery
arthritis
articular
artificial
aryl
asbestos
ascite
ascorbic
asparaginase
aspartate
aspect
aspergillus
assay
assembly
assess
assessment
associate
association
asthma
atherosclerosis
atp
atpase
atria
atrial
atrium
attenuate
auditory
aureus
author
autoimmune
autologous
automate
autonomic
autopsy
autoradiographic
auxotroph
avian
axon
axonal
bacillus
background
bacteria
bacterial
bactericidal
bacteriophage
bacterium
balance
balb
barnacle
baroreceptor
barrier
basal
base
basic
basis
bcg
bear
beef
behavior
behavioral
behaviour
benign
benzo
beta
bicarbonate
bilateral
bilayer
bile
biliary
bilirubin
bind
biochemical
biogenic
biological
biologically
biopsy
biosynthesis
biotin
birth
bis
bladder
blast
block
blockade
blocker
blood
blue
boar
body
bond
bone
border
bordetella
botulinum
bovine
bowel
bradykinin
brain
branch
breast
breathing
bronchial
brown
bundle
burn
bypass
cadmium
caffeine
calcitonin
calcium
calculation
calf
calve
camp
cancer
candida
canine
capacity
capillary
capsular
carbohydrate
carbon
carbonic
carboxylase
carboxylic
carcinogen
carcinogenesis
carcinoma
carcinomas
cardiac
cardiomyopathy
cardiopulmonary
cardiovascular
care
carotid
carrier
carry
cartilage
case
cat
catabolism
catabolite
catalase
catalyse
catalytic
catechol
catecholamine
cation
cationic
cattle
caudate
cause
cavity
cell
cellular
center
central
centrifugation
cerebellar
cerebral
cerebrospinal
cereus
cerevisiae
certain
cervical
chain
change
channel
character
characteristic
characteristics
characterization
charge
chemical
chemically
chemistry
chemotherapy
chest
chick
chicken
child
childhood
chinese
chloride
chlorpromazine
cholera
cholesterol
choline
cholinergic
cholinesterase
choriomeningitis
chromatin
chromatographic
chromatography
chromosomal
chromosome
chronic
cigarette
circadian
circular
circulate
circulation
circulatory
cirrhosis
citrate
clamp
class
classification
clearance
cleavage
clinical
clonal
clonidine
clostridium
coagulation
coat
cochlear
coefficient
coenzyme
colchicine
cold
coli
colicin
colitis
collagen
colliculus
colon
colonic
colony
column
combination
combine
common
communication
community
comparative
compare
comparison
compartment
competition
complement
complementation
complete
complex
complicate
complication
component
composition
compound
computer
concanavalin
concentration
concept
condition
conductance
conduction
conformation
conformational
congenital
conjugation
connection
connective
conscious
consequence
consideration
constant
constituent
consumption
contact
contain
content
continuous
contraceptive
contractile
contractility
contraction
contracture
contribution
control
conventional
conversion
convert
cooperative
copper
cord
coronary
correction
correlate
correlation
cortex
cortical
corticosteroid
cortisol
cortisone
count
couple
course
cow
creatine
criterion
critical
cross
crystal
cultivation
culture
cultured
current
curve
cutaneous
cyclase
cycle
cyclic
cyclophosphamide
cystic
cytochalasin
cytochemical
cytochrome
cytomegalovirus
cytoplasmic
cytotoxic
cytotoxicity
damage
dark
data
datum
day
deaminase
death
decarboxylase
decerebrate
decrease
deep
defect
defective
deferen
deficiency
deficient
define
degeneration
degradation
degree
dehydrogenase
delay
deletion
delta
demonstration
denaturation
dendritic
denervation
density
deoxy
deoxyribonucleic
dependence
dependency
dependent
deplete
depletion
depolarization
deposition
depression
deprivation
deprive
derivative
derive
dermal
description
destruction
detect
detection
detergent
determinant
determination
determine
develop
development
developmental
dextran
diabete
diabetes
diabetic
diagnosis
diagnostic
dialysis
diaphragm
diazepam
diet
dietary
difference
different
differential
differentiation
diffraction
diffusion
digestive
digoxin
dimensional
dimer
dimethyl
dinucleotide
dioxide
diphosphate
diphtheria
diploid
direct
discharge
discrimination
disease
disorder
dissociation
distal
distinct
distribution
diuretic
diurnal
divalent
division
dna
dog
domestic
donor
dopa
dopamine
dopaminergic
dorsal
dose
double
drosophila
drug
dry
duct
due
duration
dynamic
ear
early
edema
eeg
effect
effectiveness
effector
efferent
efficiency
efflux
egg
elderly
electric
electrical
electrolyte
electron
electronic
electrophoresis
electrophoretic
electrophysiological
elevate
elicit
elimination
elongation
embolism
embryo
embryonic
encephalitis
encephalomyelitis
end
endocrine
endogenous
endometrial
endotoxin
energy
enhance
enhancement
enteric
enterotoxin
envelope
environment
environmental
enzymatic
enzyme
enzymic
epidemiologic
epidemiological
epidemiology
epidermal
epidermis
epinephrine
epithelial
epithelium
equation
equilibrium
equine
error
erythematosus
erythrocyte
erythrocytes
erythropoiesis
escherichia
essential
establish
ester
esterase
estimate
estimation
estradiol
estrogen
ethanol
ethyl
ethylene
etiology
evaluation
event
evidence
evoke
evoked
evolution
examination
exchange
exchangeable
excision
excitation
excretion
exercise
exogenous
experience
experiment
experimental
experimentally
expose
exposure
expression
external
extracellular
extract
extraction
eye
facial
factor
faecalis
failure
familial
family
fast
fat
fatal
fate
fatty
feature
fecal
feed
feedback
female
fermentation
ferritin
fetal
fetus
fever
fiber
fibre
fibril
fibrillation
fibroblast
fibrosis
field
filament
filtration
finding
fine
first
fish
five
fix
fixation
flight
flora
flow
fluid
fluorescence
fluorescent
flux
focus
foetal
folate
follow
food
foot
force
form
formaldehyde
formation
four
fraction
fractionation
fragment
free
freeze
frequency
fresh
friend
frog
frozen
fructose
function
functional
galactose
galactosidase
gamma
ganglia
ganglion
gap
gas
gastric
gastrin
gastroenteritis
gastrointestinal
gel
gene
general
generation
genetic
genetically
geniculate
germination
ghost
giant
give
gland
glass
globulin
glomerular
glomerulonephritis
glucagon
glucocorticoid
gluconeogenesis
glucose
glucosidase
glucuronidase
glutamate
glutamic
glutamine
glutathione
glyceraldehyde
glycerol
glycine
glycogen
glycolysis
glycolytic
glycoprotein
gmp
gnotobiotic
goat
golgi
gradient
graft
granule
group
grow
growth
guanethidine
guanosine
guinea
half
hamster
hapten
hazard
head
health
healthy
heart
heat
heavy
hela
hemagglutination
heme
hemodialysis
hemodynamic
hemoglobin
hemolysin
hemolysis
hemolytic
hemopoietic
hemorrhage
hemorrhagic
heparin
hepatic
hepatitis
hepatoma
hereditary
herpe
herpesvirus
heterogeneity
heterologous
hexokinase
hexose
high
highly
histamine
histidine
histochemical
histocompatibility
histological
histone
history
hla
hodgkin
hog
homogenate
homograft
homologous
hormonal
hormone
horse
horseradish
hospital
host
hour
human
humoral
hybrid
hydrocarbon
hydrochloride
hydrocortisone
hydrogen
hydrolase
hydrolysis
hydroxy
hydroxybutyrate
hydroxydopamine
hydroxylase
hydroxytryptamine
hypersensitivity
hypertension
hypertensive
hypertonic
hypertrophy
hypoglycaemia
hypoglycemia
hypotension
hypothalamic
hypothalamus
hypothesis
hypoxia
hypoxic
identification
idiopathic
igg
igm
iii
ileum
illness
immediate
immune
immunity
immunization
immunize
immunochemical
immunofluorescence
immunofluorescent
immunogenicity
immunoglobulin
immunologic
immunological
immunoreactive
immunosuppression
impair
impairment
implication
importance
improve
impulse
inactivation
inactive
inbreed
incidence
incorporation
increase
incubation
independent
index
indication
indicator
indirect
individual
indomethacin
induce
inducer
inducible
induction
infancy
infant
infarct
infarction
infect
infection
infectious
infectivity
inferior
inflammation
inflammatory
influence
influenza
influx
information
infusion
ingestion
inhalation
inherit
inhibit
inhibition
inhibitor
inhibitory
initial
initiation
inject
injection
injury
innervation
inoculation
inorganic
inotropic
input
insect
insoluble
insufficiency
insulin
intact
intake
intensity
intensive
interaction
interference
interferon
intermediate
internal
interpretation
interrelationship
interval
intestinal
intestine
intra
intracellular
intracranial
intrarenal
intrauterine
intravenous
intraventricular
intrinsic
investigation
involve
involvement
inward
iodine
ion
ionic
iron
irradiate
irradiation
ischaemic
ischemia
ischemic
islet
isocitrate
isoenzyme
isolate
isolated
isolation
isoleucine
isomerase
isoprenaline
isoproterenol
isotope
isozyme
japanese
joint
junction
juvenile
kallikrein
ketone
kidney
kill
kinase
kinetic
kinetics
kitten
label
laboratory
lac
lack
lactate
lactic
lactobacillus
lactose
lamb
lambda
large
laser
late
lateral
layer
lead
leaf
learn
leave
lecithin
length
leprosy
lesion
lethal
leucine
leucocyte
leukaemia
leukemia
leukemic
leukocyte
level
life
ligand
light
like
limb
limit
limitation
line
linear
link
linkage
lipase
lipid
lipogenesis
lipolysis
lipopolysaccharide
lipoprotein
liquid
listeria
literature
live
liver
load
loading
local
localization
location
loci
locus
long
longitudinal
loss
low
lumbar
lung
lupus
lymph
lymphatic
lymphocyte
lymphocytic
lymphoid
lymphoma
lymphomas
lysine
lysis
lysosomal
lysosome
lysozyme
lytic
macromolecular
macrophage
magnesium
magnetic
maintenance
major
malaria
malate
male
malignant
mammalian
mammary
man
management
manganese
manifestation
map
mapping
marek
marine
marker
marrow
mass
mast
material
maternal
mathematical
maturation
mature
maturity
mean
measure
measurement
meat
mechanic
mechanical
mechanism
medial
mediate
medical
medium
medulla
medullary
megaterium
melanoma
mellitus
membrane
memory
meningitis
mental
mercury
mesenteric
messenger
metabolic
metabolism
metabolite
metal
methionine
method
methyl
mice
micro
microbial
microbiological
microorganism
microscope
microscopic
microscopy
microsomal
middle
migration
mild
milk
mitochondria
mitochondrial
mitogen
mitogenic
mitosis
mitotic
mitral
mix
mixed
mixture
mobility
mode
model
modification
modify
modulation
molecular
molecule
monkey
monoamine
monocytogene
monolayer
mononuclear
monophosphate
monoxide
month
morphine
morphogenesis
morphologic
morphological
morphology
morphometric
mortality
mother
motoneurone
motor
mouse
mouth
movement
mucopolysaccharide
mucosa
mucosal
multiple
murine
muscle
muscular
mutant
mutation
mutator
mycobacterium
mycoplasma
myelin
myelinate
myeloma
myocardial
myocardium
myosin
natural
naturally
nature
neck
necrosis
negative
neisseria
neonatal
neoplasia
neoplastic
nerve
nervous
neural
neuroblastoma
neuromuscular
neuron
neuronal
neurone
neurospora
neutral
new
newborn
newcastle
newly
nicotinamide
nicotine
nitrate
nitro
nitrogen
node
noise
non
nonspecific
noradrenaline
noradrenergic
norepinephrine
normal
normotensive
note
novel
nuclear
nuclei
nucleic
nucleoside
nucleotide
nucleotides
nucleus
number
nutrition
nutritional
nzb
obese
obesity
observation
observe
obstruction
obstructive
obtain
occlusion
occur
occurrence
oil
old
one
onset
ontogeny
open
operation
operative
operon
optic
optical
optimal
oral
organ
organic
organism
organization
orientation
origin
oscillation
osmotic
ouabain
outcome
outer
output
ovarian
ovary
oxidase
oxidation
oxidative
oxide
oxygen
oxytocin
pain
pancrea
pancreas
pancreatic
papain
parameter
parasite
parathyroid
parental
parietal
part
partial
participation
particle
particular
passive
pasteurella
pathogenesis
pathologic
pathological
pathology
pathway
patient
pattern
penicillin
pepsin
peptide
per
performance
perfringen
perfuse
perfusion
perinatal
period
peripheral
peritoneal
permeability
peroxidase
peroxide
persistence
persistent
person
pertussis
pgo
pha
phage
phagocytic
phagocytosis
pharmacological
pharmacology
phase
phenomenon
phenylalanine
phosphatase
phosphate
phosphodiesterase
phosphoenolpyruvate
phosphofructokinase
phospholipase
phospholipid
phosphorylase
phosphorylation
physical
physicochemical
physiologic
physiological
physiology
phytohemagglutinin
pig
piglet
pigment
pineal
pituitary
placental
plant
plaque
plasma
plasmid
plasmodium
platelet
plus
pneumonia
pneumoniae
poison
polarity
poliovirus
poly
polymerase
polymorphonuclear
polynucleotide
polypeptide
polysaccharide
pontine
pool
population
porcine
portal
positive
possible
post
posterior
postnatal
postoperative
potassium
potent
potential
potentiation
practice
pre
precursor
prediction
pregnancy
pregnant
preliminary
premature
prenatal
preoperative
preparation
prepare
presence
present
pressor
pressure
prevalence
prevention
primary
primate
prime
principle
probe
problem
procedure
process
processing
produce
product
production
profile
progesterone
prognosis
prognostic
progressive
proinsulin
projection
prolactin
proliferation
proliferative
proline
prolong
prolonged
propagation
property
propionate
propranolol
prospective
prostaglandin
prostate
protease
protection
protective
protein
proteinase
proteolytic
proton
proximal
pseudomona
pseudomonas
psychiatric
pulmonary
pump
purification
purify
purine
purkinje
pyrene
pyrimidine
pyrophosphate
pyruvate
quantitation
quantitative
rabbit
radiation
radioactive
radioautographic
radioimmunoassay
radiotherapy
rana
range
rapid
rat
rate
ratio
rauscher
ray
reabsorption
react
reaction
reactive
reactivity
reagent
rec
recent
receptive
receptor
recipient
recognition
recombination
reconstitution
reconstruction
record
recovery
rectification
recurrent
red
reduce
reductase
reduction
reference
reflex
reflexe
regeneration
region
regional
regression
regulation
regulatory
rejection
relate
relation
relationship
relative
relaxation
release
removal
renal
renin
renovascular
repair
repeat
replacement
replication
report
repression
require
requirement
research
resection
reserpine
residue
resistance
resistant
resolution
resonance
respiration
respiratory
response
responsiveness
rest
restriction
result
retardation
retention
reticular
reticulum
retina
retinal
retrograde
revascularization
reveal
reversal
reversible
review
rhesus
rheumatic
rheumatoid
rhythm
ribonuclease
ribonucleic
ribosomal
ribosome
rich
right
risk
rna
rod
role
root
rosette
route
rubella
rupture
saccharomyce
saline
salivary
salmonella
salt
sample
sar
saralasin
sarcoma
sarcoplasmic
sartorius
scan
scatter
schizophrenia
sclerosis
screen
screening
sea
second
secondary
secretion
secretory
section
sedimentation
segment
select
selection
selective
self
sendai
sensitive
sensitivity
sensitization
sensitize
sensitized
sensory
separation
septal
sequence
sequential
sera
serial
series
serine
serological
serotonin
serum
several
severe
sex
sexual
sheep
shock
short
sickle
sign
signal
significance
simian
simple
simplex
simulation
simultaneous
single
sinus
site
situ
six
size
skeletal
skin
sleep
slice
slow
small
smoke
smoking
smooth
social
sodium
solid
soluble
solution
somatic
somatomedin
somatosensory
somatostatin
source
sow
space
spatial
special
specie
species
specific
specificity
specimen
spectra
spectral
spectrum
sperm
spin
spinal
spindle
spleen
splenectomy
splenic
spontaneous
spontaneously
spore
sporulation
spread
squid
stability
stable
stage
stain
staphylococcal
staphylococcus
starvation
state
states
statistical
status
steady
stearothermophilus
stem
stenosis
steroid
sterol
stimulate
stimulation
stimuli
stimulus
stomach
storage
strain
strand
strength
streptococcal
streptococci
streptococcus
streptomyce
streptomycin
stress
stretch
striate
strip
stroke
structural
structure
studies
study
subcellular
subject
subpopulation
subsequent
substance
substitute
substrate
subtili
subunit
succinate
sucrose
sudden
sugar
suicide
sulfate
sulfur
sulphate
superior
supply
suppression
suppressor
surface
surfactant
surgery
surgical
survey
survival
susceptibility
suspension
sweat
swine
sympathetic
sympathomimetic
synapsis
synaptic
syndrome
syngeneic
synovial
synthase
synthesis
synthesize
synthetase
synthetic
system
systemic
taenia
target
technique
temperature
tension
term
terminal
test
testicular
testing
testis
testosterone
tetracycline
thalamus
theoretical
theory
therapeutic
therapy
thermal
thiamine
thickness
thin
thoracic
three
threonine
threshold
thrombosis
thymic
thymidine
thymine
thymineless
thymus
thyroid
thyrotropin
thyroxine
time
tissue
titration
toad
tobacco
tolbutamide
tolerance
tolerant
tonic
total
toward
toxic
toxicity
toxin
tracer
tracheal
tract
training
trans
transcription
transfer
transferase
transform
transformation
transfusion
transient
transl
translocation
transmissible
transmission
transmitter
transplant
transplantation
transport
transverse
trauma
treat
treatment
trial
trigeminal
triglyceride
triiodothyronine
triphosphatase
triphosphate
tritiate
trna
trypsin
tryptophan
tube
tuberculin
tuberculosis
tubular
tubule
tumor
tumors
tumour
turkey
turnover
twin
twitch
two
type
typhimurium
tyramine
tyrosine
ulcer
ultrastructural
ultrastructure
ultraviolet
unilateral
unit
united
unusual
upon
upper
uptake
urea
uridine
urinary
urine
use
uterine
uterus
utilization
utilize
vaccination
vaccine
vaccinia
vagal
vagotomy
valine
value
valve
var
variability
variable
variant
variation
various
vas
vascular
vasopressin
vein
velocity
venous
ventilation
ventral
ventricle
ventricular
versus
vertebrate
vesicle
vesicular
vessel
vestibular
via
viability
vibrio
vii
viral
virulence
virus
viruse
visual
vitamin
vitro
vivo
voltage
volume
wall
wash
water
wave
weight
white
whole
wild
withdrawal
within
without
woman
work
worker
wound
year
yeast
yield
young
zinc
zonal
zone
